/*
Заголовковий файл "Config.h" використовується для оголощення
констант які будуть використовуватись в програмі
*/

/*
Використовую "include guard" для того, щоб уникнути потенційних помилок
з подвійним підключенням заголовкового файлу при компіляції 
*/
#ifndef CONFIG_H
#define CONFIG_H

/*
Підключаю стандартну бібліотеку "string"
і прописуємо "using namespace std" для зручності
*/
#include <string>
using namespace std;

/*
Дві цілочисельні константи які відповідно позначають кількість рядків і стовпців
*/
const int ROWS = 9;
const int COLS = 9;

/*
Константи для фарбування виводу термінала (ANSI escape-коди)
*/
const string COLOR = "\033[30;47m";
const string RESET = "\033[0m";

#endif //Закриття блоку захисту від подвійного підключення